{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача А: Покупка Испаньолы.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Условие и вопрос задачи задачи предельно понятны:нужно определить четность суммы делителей числа $N$.   \n",
    "**Наивное решение**: найти все делители числа $N$, просуммировать их и посмотреть четность суммы. Однако, на ограничениях задачи ($N \\leq 10^{18})$ такое решение получит TL."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Полное решение.**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рассмотрим разложение числа $N$ на простые множители:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$N = p_1^{k_1}p_2^{k_2}p_3^{k_3}...p_m^{k_m}$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Имеем два случая:  \n",
    "+ $p_1 = 2$\n",
    "+ $p_1 \\neq 2$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рассмотрим второй случай. Имея разложение на простые множители, можно найти все делители числа. В нашем случае все делители будут нечетные. Сколько таких делителей? Делители числа идут парами, кроме случая, когда число - полный квадрат, в этом случае один делитель непарный. Значит, если число, в разложении которого на простые множители отсутствует степент двойки, не является полным квадратом , оно имеет четное количество нечетных делителей, которые в сумме дают четное число. Если же число является полным квадратом, то мы имеем нечетное количество нечетных делителей, которые в сумме дают нечетное число."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рассмотрим первый случай и сведем его ко второму. Число $N$, в разложении которого на простые множители есть степень двойки, имеет четные делители. Их количество не важно, в сумме они дают четное число. Если $N$ не степень двойки, в его разложении будут и нечетные множители.   \n",
    "$N = 2^{k_1}p_2^{k_2}p_3^{k_3}...p_m^{k_m}$  \n",
    "Пусть $N_1 = p_2^{k_2}p_3^{k_3}...p_n^{k_n}$.   \n",
    "Числа такого вида рассмотрены во втором случае. Если $N_1$ не полный квадрат - сумма его делителей четна, в противном случае - нечетна."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**План решения задачи А:** делим число$N$ на два пока это возможно. Если полученное после этой процедуры число является полным квадратом, то не получится купить Испаньолу, иначе - получится."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15\n",
      "YES\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "while n % 2 == 0:\n",
    "    n //= 2\n",
    "\n",
    "m = int(n ** .5)\n",
    "if m * m == n:\n",
    "    print('NO')\n",
    "else:\n",
    "    print('YES')\n",
    "    "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
